# Data Selection & Filtering in Pandas

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data2.csv") #read the csv file

In [3]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

### Basic Operations on Columns and Rows
We are exploring the basic operation like selecting the cols and rows

In [4]:
df['Actor'] #Selecting Rows

0         Shah Rukh Khan
1            Salman Khan
2             Aamir Khan
3          Ranbir Kapoor
4          Ranveer Singh
5     Ayushmann Khurrana
6          Rajkummar Rao
7         Hrithik Roshan
8           Akshay Kumar
9          Kartik Aaryan
10          Varun Dhawan
11         Vicky Kaushal
Name: Actor, dtype: object

In [5]:
df['Actor'][3] #Selecting Rows and Columns

'Ranbir Kapoor'

In [6]:
df[['Actor', 'IMDb']] #Selecting multiple rows

                 Actor  IMDb
0       Shah Rukh Khan   7.2
1          Salman Khan   6.0
2           Aamir Khan   8.4
3        Ranbir Kapoor   5.6
4        Ranveer Singh   7.0
5   Ayushmann Khurrana   8.3
6        Rajkummar Rao   7.5
7       Hrithik Roshan   6.5
8         Akshay Kumar   7.0
9        Kartik Aaryan   5.9
10        Varun Dhawan   6.1
11       Vicky Kaushal   8.2

In [7]:
df.iloc[1] #Selecting by Row (by position)

Actor                       Salman Khan
Film                    Tiger Zinda Hai
Year                               2017
Genre                            Action
BoxOffice(INR Crore)                565
IMDb                                6.0
Name: 1, dtype: object

In [8]:
df.loc[7, 'Genre']

'Action'

In [9]:
df.iloc[7, 3]

'Action'

In [10]:
df.loc[0:2, ["Film", "Actor", "Genre"]] #Slicing of the table (2 has been part of the slicing using loc

              Film           Actor      Genre
0          Pathaan  Shah Rukh Khan     Action
1  Tiger Zinda Hai     Salman Khan     Action
2           Dangal      Aamir Khan  Biography

In [11]:
df.iloc[0:2, 0:2] #2 has been not part of the slicing using iloc

            Actor             Film
0  Shah Rukh Khan          Pathaan
1     Salman Khan  Tiger Zinda Hai

In [12]:
df.at[0, 'Actor']

'Shah Rukh Khan'

In [13]:
df.iat[0, 0]

'Shah Rukh Khan'

In [14]:
df[df['IMDb']>6]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

We can apply boolean logic like (AND, OR) while selecting

In [15]:
df[(df['IMDb']>6) & (df['Year']>2018) ] #AND Logic

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [16]:
df[(df['IMDb']>6) | (df['Year']>2018) ] #OR Logic

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

## Using Querying when filtering the datasets

### What is .query() ?
The query() command in pandas lets you filter rows using a clean, SQL-like syntax, making complex conditions easier to read than traditional boolean indexing. Instead of writing long bracket conditions, you can express filters as strings, like "Amount > 500 and Location == 'Seattle'". Inside query(), you reference column names directly, without needing data['column'] syntax. It also supports logical operators (and, or, not), comparisons, and even variables using the @ symbol. Overall, query() improves code readability and helps analysts write expressive, intuitive filters, especially when working with large datasets.

In [17]:
df.query("Year > 2018 and IMDb >6")

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

# Finance Example: 

### We will be using Credit Card Transaction data of 100 users to do our analysis

In [18]:
df = pd.read_excel('credit_card_trans.xlsx') #Loading data

In [19]:
df

,User_ID,Transaction_ID,Date,Time,Location,ZIP_Code,Amount,Merchant,Category,Transaction_Type,Status,MCC,MCC Stands,Is_Online,Fraud_Flag,User_Age_Group,Card_Type
0,USER_001,2867825,2025-12-09,17,Seattle,98101,377.67,Amazon,Clothing,Purchase,Approved,5541,Service Stations,True,0,18-24,Amex
1,USER_002,1419610,2025-12-06,10,Dallas,75201,950.96,Starbucks,Dining,Refund,Approved,5651,Family Clothing Stores,True,0,25-34,Discover
2,USER_003,5614226,2025-11-27,19,Houston,77001,733.33,McDonalds,Groceries,Purchase,Approved,5732,Electronics Stores,False,0,18-24,Visa
3,USER_004,5108603,2025-11-23,7,San Francisco,94101,600.67,Best Buy,Dining,Purchase,Approved,5651,Family Clothing Stores,True,0,35-44,Amex
4,USER_005,4744854,2025-11-22,20,Los Angeles,90001,160.24,Online Shop,Utilities,Purchase,Approved,5999,Miscellaneous,False,0,18-24,Mastercard
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,USER_096,9279821,2024-12-18,0,San Francisco,94101,496.33,Target,Fuel,Purchase,Approved,5310,Department Stores,True,0,25-34,Mastercard
96,USER_097,2525206,2024-12-14,11,Austin,73301,525.12,McDonalds,Electronics,Purchase,Approved,5651,Family Clothing Stores,False,0,18-24,Discover
97,USER_098,1790481,2024-12-12,7,Houston,77001,430.40,Best Buy,Fuel,Purchase,Approved,5999,Miscellaneous,True,0,18-24,Mastercard
98,USER_099,2839607,2024-12-10,18,Seattle,98101,30.29,Gas Station,Travel,Purchase,Declined,5732,Electronics Stores,False,0,45-54,Mastercard
99,USER_100,3564251,2024-12-09,10,Phoenix,85001,112.35,Starbucks,Electronics,Purchase,Approved,5732,Electronics Stores,False,0,18-24,Mastercard

Below is the List of columns we have in our datasets to look forward

In [20]:
df.columns #Columns Details

Index(['User_ID', 'Transaction_ID', 'Date', 'Time', 'Location', 'ZIP_Code',
       'Amount', 'Merchant', 'Category', 'Transaction_Type', 'Status', 'MCC',
       'MCC Stands', 'Is_Online', 'Fraud_Flag', 'User_Age_Group', 'Card_Type'],
      dtype='object')

In [21]:
df.head() #Top 5 Rows

,User_ID,Transaction_ID,Date,Time,Location,ZIP_Code,Amount,Merchant,Category,Transaction_Type,Status,MCC,MCC Stands,Is_Online,Fraud_Flag,User_Age_Group,Card_Type
0,USER_001,2867825,2025-12-09,17,Seattle,98101,377.67,Amazon,Clothing,Purchase,Approved,5541,Service Stations,True,0,18-24,Amex
1,USER_002,1419610,2025-12-06,10,Dallas,75201,950.96,Starbucks,Dining,Refund,Approved,5651,Family Clothing Stores,True,0,25-34,Discover
2,USER_003,5614226,2025-11-27,19,Houston,77001,733.33,McDonalds,Groceries,Purchase,Approved,5732,Electronics Stores,False,0,18-24,Visa
3,USER_004,5108603,2025-11-23,7,San Francisco,94101,600.67,Best Buy,Dining,Purchase,Approved,5651,Family Clothing Stores,True,0,35-44,Amex
4,USER_005,4744854,2025-11-22,20,Los Angeles,90001,160.24,Online Shop,Utilities,Purchase,Approved,5999,Miscellaneous,False,0,18-24,Mastercard

### Initial Sorting of data:
We have sort our data which is required for our analysis, we will using .copy() to make sure that we have not made any changes in our original data

In [22]:
data = df[['User_ID', 'Transaction_ID', 'Date', 'Location', 'Amount', 'Transaction_Type', 'User_Age_Group', 'Card_Type']].copy()

data

,User_ID,Transaction_ID,Date,Location,Amount,Transaction_Type,User_Age_Group,Card_Type
0,USER_001,2867825,2025-12-09,Seattle,377.67,Purchase,18-24,Amex
1,USER_002,1419610,2025-12-06,Dallas,950.96,Refund,25-34,Discover
2,USER_003,5614226,2025-11-27,Houston,733.33,Purchase,18-24,Visa
3,USER_004,5108603,2025-11-23,San Francisco,600.67,Purchase,35-44,Amex
4,USER_005,4744854,2025-11-22,Los Angeles,160.24,Purchase,18-24,Mastercard
...,...,...,...,...,...,...,...,...
95,USER_096,9279821,2024-12-18,San Francisco,496.33,Purchase,25-34,Mastercard
96,USER_097,2525206,2024-12-14,Austin,525.12,Purchase,18-24,Discover
97,USER_098,1790481,2024-12-12,Houston,430.40,Purchase,18-24,Mastercard
98,USER_099,2839607,2024-12-10,Seattle,30.29,Purchase,45-54,Mastercard
99,USER_100,3564251,2024-12-09,Phoenix,112.35,Purchase,18-24,Mastercard

In [23]:
data.loc[0:100, 'Amount']

0     377.67
1     950.96
2     733.33
3     600.67
4     160.24
       ...
95    496.33
96    525.12
97    430.40
98     30.29
99    112.35
Name: Amount, Length: 100, dtype: float64

### Now we are taking the sum of "Amount" column

In [24]:
sum = data.loc[0:100, 'Amount'].sum()
print("Total Amount: $",f"{sum:,.2f}")

Total Amount: $ 47,282.94

### Using Mode for User_Age_Group

In [25]:
data.loc[0:100, 'User_Age_Group'].mode() #The most repetitive age group in our dataset

0    35-44
Name: User_Age_Group, dtype: object

### Most used Card Service in our dataset (Visa, Mastercard etc)

In [26]:
data['Card_Type'].value_counts()

Card_Type
Mastercard    33
Visa          25
Amex          23
Discover      19
Name: count, dtype: int64

### Location Wise Summary of Dataset

In [27]:
location_total = data.groupby("Location")["Amount"].sum()
print(f"{location_total}")
print("Total Amount: $",location_total.sum())

Location
Austin           1829.13
Charlotte        2137.96
Chicago          1527.23
Columbus         2059.43
Dallas           2264.70
Denver           3030.48
Fort Worth        709.96
Houston          2370.75
Jacksonville     3142.31
Los Angeles      2069.59
New York          439.26
Philadelphia     2431.03
Phoenix           464.26
San Antonio      3362.13
San Diego        1649.19
San Francisco    3791.84
San Jose         3880.56
Seattle          6848.12
Washington       3275.01
Name: Amount, dtype: float64
Total Amount: $ 47282.94

In [28]:
data['Location'].value_counts() ##Number of times

Location
Seattle          16
San Francisco     8
Jacksonville      7
San Antonio       7
San Jose          7
Washington        6
Denver            5
Dallas            5
Houston           5
Philadelphia      4
Los Angeles       4
San Diego         4
Austin            4
Charlotte         4
Phoenix           4
Columbus          3
Chicago           3
Fort Worth        2
New York          2
Name: count, dtype: int64

### Filtering where the Amount >= $900

In [29]:
data[data["Amount"] >= 900] #Amount greater than $900 in the dataset

,User_ID,Transaction_ID,Date,Location,Amount,Transaction_Type,User_Age_Group,Card_Type
1,USER_002,1419610,2025-12-06,Dallas,950.96,Refund,25-34,Discover
11,USER_012,2571945,2025-10-28,Jacksonville,970.06,Refund,45-54,Discover
33,USER_034,7022674,2025-08-25,San Jose,949.14,Purchase,25-34,Discover
34,USER_035,6770619,2025-08-25,Seattle,965.80,Purchase,35-44,Discover
43,USER_044,7067228,2025-07-19,San Jose,909.77,Purchase,55+,Amex
49,USER_051,4905582,2025-06-18,Los Angeles,969.74,Refund,25-34,Mastercard
52,USER_053,7377459,2025-06-01,Philadelphia,939.80,Payment,45-54,Mastercard
55,USER_056,7120868,2025-05-17,Jacksonville,922.26,Purchase,18-24,Mastercard
69,USER_070,4684531,2025-03-31,Seattle,986.95,Purchase,18-24,Visa

### Now we are filtering the data of Month of May (only)

In [30]:
may_data = data[(data['Date'] >= '2025-05-01') & (data['Date'] <= '2025-05-31')].copy()

may_data

,User_ID,Transaction_ID,Date,Location,Amount,Transaction_Type,User_Age_Group,Card_Type
53,USER_054,5663623,2025-05-31,Chicago,895.35,Purchase,35-44,Amex
54,USER_055,8606962,2025-05-23,San Antonio,599.91,Refund,18-24,Mastercard
55,USER_056,7120868,2025-05-17,Jacksonville,922.26,Purchase,18-24,Mastercard
56,USER_057,3728882,2025-05-15,Charlotte,93.05,Purchase,35-44,Discover
57,USER_058,7210606,2025-05-10,Phoenix,200.00,Purchase,45-54,Visa
58,USER_059,6960453,2025-05-08,Seattle,50.00,Payment,25-34,Discover

In [31]:
sum_of_may = may_data.loc[0:100, 'Amount'].sum()
print(f"Total Amount for May: ${sum_of_may:,.2f}")

Total Amount for May: $2,760.57

# Querying with .query()

### Filtering the Age Group "18-24" who did the transaction >= 500

In [32]:
s = data.query("Amount >= 500 and User_Age_Group == '18-24'")
s

,User_ID,Transaction_ID,Date,Location,Amount,Transaction_Type,User_Age_Group,Card_Type
2,USER_003,5614226,2025-11-27,Houston,733.33,Purchase,18-24,Visa
17,USER_018,8038374,2025-10-10,San Jose,527.13,Purchase,18-24,Mastercard
27,USER_028,4612365,2025-09-09,Austin,516.66,Refund,18-24,Mastercard
54,USER_055,8606962,2025-05-23,San Antonio,599.91,Refund,18-24,Mastercard
55,USER_056,7120868,2025-05-17,Jacksonville,922.26,Purchase,18-24,Mastercard
69,USER_070,4684531,2025-03-31,Seattle,986.95,Purchase,18-24,Visa
74,USER_075,6292423,2025-03-03,Denver,708.32,Purchase,18-24,Visa
91,USER_092,7073292,2025-01-10,Columbus,714.68,Purchase,18-24,Amex
96,USER_097,2525206,2024-12-14,Austin,525.12,Purchase,18-24,Discover

In [33]:
# To pass an external variable 

ext_var = "18-24"
exp = data.query("Amount >= 500 and User_Age_Group == @ext_var")
exp

,User_ID,Transaction_ID,Date,Location,Amount,Transaction_Type,User_Age_Group,Card_Type
2,USER_003,5614226,2025-11-27,Houston,733.33,Purchase,18-24,Visa
17,USER_018,8038374,2025-10-10,San Jose,527.13,Purchase,18-24,Mastercard
27,USER_028,4612365,2025-09-09,Austin,516.66,Refund,18-24,Mastercard
54,USER_055,8606962,2025-05-23,San Antonio,599.91,Refund,18-24,Mastercard
55,USER_056,7120868,2025-05-17,Jacksonville,922.26,Purchase,18-24,Mastercard
69,USER_070,4684531,2025-03-31,Seattle,986.95,Purchase,18-24,Visa
74,USER_075,6292423,2025-03-03,Denver,708.32,Purchase,18-24,Visa
91,USER_092,7073292,2025-01-10,Columbus,714.68,Purchase,18-24,Amex
96,USER_097,2525206,2024-12-14,Austin,525.12,Purchase,18-24,Discover

You can clearly see that we received same output